{
    "version": "https://jsonfeed.org/version/1",
    "title": "Captain Embedded 👨🏻‍✈️⚓",
    "description": "",
    "home_page_url": "https://rosmianto.com",
    "feed_url": "https://rosmianto.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Rosmianto A. Saputro"
    },
    "items": [
        {
            "id": "https://rosmianto.com/how-to-do-freelancing-as-an-embedded-engineer.html",
            "url": "https://rosmianto.com/how-to-do-freelancing-as-an-embedded-engineer.html",
            "title": "How to Do Freelancing As an Embedded Engineer",
            "summary": "Freelance is a wonderful world: It offers lots of freedom and flexibility. But, given those pluses, freelance is also hard. Because instead of just do the tasks from your boss, now you have to find clients. Sometimes it's easy, but often it's challenging to get&hellip;",
            "content_html": "<p>Freelance is a wonderful world:</p>\n<ul>\n<li>You get to choose who you work with.</li>\n<li>You get to choose what project you work on.</li>\n<li>You get to choose how much you are getting paid.</li>\n</ul>\n<p>It offers lots of freedom and flexibility.</p>\n<p>But, given those pluses, freelance is also hard. Because instead of just do the tasks from your boss, now you have to find clients. Sometimes it's easy, but often it's challenging to get clients.</p>\n<p>But again, the pluses far outweight the minuses. No wonder if freelancing is soo seductive for many talented engineers. It's too sexy to ignore. You should not quit your main job if you have zero knowledge of freelance world.</p>\n<p>That's too risky.</p>\n<p>Now, to be a freelance embedded engineer, I need to assess your profile first.</p>\n<p>I will be using my 3-check criteria to check your readiness:</p>\n<ol>\n<li>2 years of experience minimum</li>\n<li>10+ hours a week to spare</li>\n<li>Self-disciplined and autonomous</li>\n</ol>\n<p>Let's dissect them one by one.</p>\n<h3>1. Two Years of Experience Minimum</h3>\n<p>2 years minimum is subjective criteria, actually. But it helps me to see if someone has enough exposure to corporate world.</p>\n<p>Less than 2-years usually an engineer still don't know the full cycle of embedded project development. They never shipped a product, never tested device on the field, never knew how to handle business pressure to technical development.</p>\n<p>If you have less than 2, you still can be a freelancer, but I'm afraid you will not survive and left negative views of freelance world.</p>\n<h3>2. 10+ Hours/week To Spare</h3>\n<p>Now, accepting freelance project means you work outside your main job. And the great part of freelance is, you have the freedom to set your schedule. You just need to make sure your clients kept updated every week.</p>\n<p>In my experience, 10 hours a week at minimum is a sweet-spot to make a significant project progress. Less than that usually you can only do minor work. And most clients also have time constraint.</p>\n<p>Because I say 10 hours a week, that means you can work 2 hours on Monday, 2 hours Tuesday, and 6 hours on Saturday. Or..</p>\n<p>5 hours on Saturday, 5 hours on Sunday. You get the idea. You pick yourself.</p>\n<p>Make sure you send the progress update to your clients every week.</p>\n<h3>3. Self-Discliplined and Autonomous</h3>\n<p>Lastly, you have to have those 2 traits: self-discliplined and autonomous.</p>\n<p>If you need to constantly be told what to do, what next, how to do it. Ahh, forget freelancing. It won't suit your style.</p>\n<p>Because in reality, freelancing requires lots of disclipline, because your clients don't know what you should do. That's why they hired you as a freelancer.</p>\n<p>They don't have the bandwidth to check your work every hour.</p>\n<p>They only have the money to pay your work.</p>\n<p>In my experience, someone who has these traits are usually a senior engineer.</p>\n<h2>How to Land Freelance Clients</h2>\n<p>Now, if you passed those 3-check criteria, you are ready to get clients. My method below is for long-term </p>\n<p>Follow my 3-step framework to get clients:</p>\n<p>👉 Set your expertise. What projects do you want to do? Robotics? IoT? Firmware Development?</p>\n<p>👉 “Attract” not “hunt” clients. Do that by showing your expertise through posts on LinkedIn.</p>\n<p>👉 This is the hardest step, it might test how serious you are. Publish daily for the next 30 days.<br><br>Do that and you will have someone DM you end of the month.</p>",
            "author": {
                "name": "Rosmianto A. Saputro"
            },
            "tags": [
                   "Embedded Freelancing"
            ],
            "date_published": "2024-03-10T10:20:27+07:00",
            "date_modified": "2024-03-10T10:58:07+07:00"
        },
        {
            "id": "https://rosmianto.com/yes-you-can-use-arduino-for-commercial-grade-only-if-you-do-this.html",
            "url": "https://rosmianto.com/yes-you-can-use-arduino-for-commercial-grade-only-if-you-do-this.html",
            "title": "Yes, You Can Use Arduino for Commercial-grade, Only If You Do This",
            "summary": "I need to reimphasize this: Yes, Arduino is a toy. And by a toy, I mean Scratch-the-programming-language toy. Arduino is the Scratch of embedded world. But can you use Arduino for industrial or commercial-grade projects? The answer is also YES. Before we continue, I need&hellip;",
            "content_html": "<p>I need to reimphasize this:</p>\n<p><em>Yes, Arduino is <strong>a toy</strong>. And by a toy, I mean Scratch-the-programming-language toy. Arduino is the Scratch of embedded world.</em></p>\n<p>But can you use Arduino for industrial or commercial-grade projects?</p>\n<p>The answer is also YES.</p>\n<p>Before we continue, I need to make sure that Arduino can refer to many things:</p>\n<ul>\n<li>Arduino Boards (UNO, Nano, Micro, etc.)</li>\n<li>Arduino IDE (The program you use to type code and upload code)</li>\n<li>Arduino Framework (The entire embedded software libraries so you can use <code>Serial.begin()</code>, <code>millis()</code>, <code>delay()</code>, etc.)</li>\n<li>Arduino Community (forum.arduino.cc)</li>\n</ul>\n<p>In this article, we're going to refer Arduino as the Boards and Framework.</p>\n<h2>Why Did People Think Arduino is a Toy?</h2>\n<p>Because like any other toys, Arduino does:</p>\n<ul>\n<li>Simplify a lot of things</li>\n<li>Is cheap enough</li>\n<li>Is easy enough to get started with</li>\n</ul>\n<p>Arduino literally has lowered the barrier to entry embedded world. Before this, you have to use complicated boards (do you know BASIC Stamp?) with <em>weird </em>setup and boring documentation.</p>\n<p>From there, Arduino has been associated with fun and cool projects, sometimes even a literal kid was teaching us to explore Arduino (remember Super-Awesome Sylvia?), no wonder if people start thinking Arduino == Toy.</p>\n<p>And you must understand, that ironically, Arduino isn't aimed for embedded engineers.</p>\n<h2>Arduino Is Aimed for This Market Segment</h2>\n<p>Arduino is designed to be used by hobbyists and artists. People with no embedded background. So those people can make interactive art projects without much knowing technical stuff.</p>\n<p>Yes, I know that Arduino is now expanding their business and try to capture industrial IoT (with Arduino PRO series). But for the majority of their market, it's still hobbyists.</p>\n<p>Fortunately, Arduino as a board is just another embedded board, just like STM32 Development Board. Which is perfect for embedded engineers to use for many applications, including industrial/commercial projects.</p>\n<h2>You Can Use Arduino If You Only Do This</h2>\n<p>By treating Arduino just like other embedded tools.</p>\n<p>What does that mean? Arduino, in its core, is just an microcontroller chip with some external components. So you can use it safely by:</p>\n<ol>\n<li>Enforcing high-standard embedded environments</li>\n<li>Insanely good coding standard</li>\n<li>Superb firmware architecture design (this one is very important)</li>\n<li>Understanding the hardware limitation</li>\n<li>Thorough testing and certification process</li>\n</ol>\n<p>In fact, Arduino UNO contains ATMega328P. That microcontroller is actually a commercial-ready chip. So don't worry. Atmel (now Microchip) even provides automotive-grade chip of ATMega328P. Do you still think it's a <strong>toy</strong>?</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://rosmianto.com/media/posts/5/Screenshot-2024-02-11-at-12.47.28.png\" alt=\"ATMega328P is available with the automotive-grade variant\" width=\"1828\" height=\"520\" sizes=\"100vw\" srcset=\"https://rosmianto.com/media/posts/5/responsive/Screenshot-2024-02-11-at-12.47.28-xs.png 300w ,https://rosmianto.com/media/posts/5/responsive/Screenshot-2024-02-11-at-12.47.28-sm.png 480w ,https://rosmianto.com/media/posts/5/responsive/Screenshot-2024-02-11-at-12.47.28-md.png 768w ,https://rosmianto.com/media/posts/5/responsive/Screenshot-2024-02-11-at-12.47.28-lg.png 1024w ,https://rosmianto.com/media/posts/5/responsive/Screenshot-2024-02-11-at-12.47.28-xl.png 1360w ,https://rosmianto.com/media/posts/5/responsive/Screenshot-2024-02-11-at-12.47.28-2xl.png 1600w\"></figure>\n<figcaption >You can get automotive-grade variant of ATMega328P</figcaption>\n</figure>\n<h2>Okay, What About Arduino Framework? It's Sub-Standard.</h2>\n<p>Yes Arduino Framework simplifies lots of things. But saying it as sub-standard software is an insult.</p>\n<p>Treat Arduino Framework like CMSIS or mbed framework. Problem's solved.</p>\n<p>In fact, Arduino and countless libraries have been used, tested, reported, and fixed by hundreds or thousands engineers around the world. Ditching Arduino Framework to favor your own in-house solution is like ditching AES-128 algorithm to make your own cryptographic algorithm. It's a bad idea.</p>\n<p>Now, to make Arduino framework more polished, do these:</p>\n<ol>\n<li>Ditch Arduino IDE and switch to VSCode + PlatformIO</li>\n<li>Start separating your code into logical module. We call this modular programming</li>\n<li>Use useful C and C++ features (like classes, virtual function, polymorphism, or even std::function if you feel fancy today)</li>\n<li>Write proper unit-tests and do proper testing process</li>\n<li>Use static analyzer and advanced linter</li>\n<li>Lastly, you have to learn how a professional, industrial, commercial-grade firmware are being done.</li>\n</ol>\n<p>That's all you need to do to use Arduino for serious applications.</p>\n<p>For the Point 6, if you are interested developing a better firmware, I made a paid guide where I show you the exact workflow I use to build firmware for my company and my freelance clients. Check it out here: <a href=\"https://fwguide.rosmianto.com?utm_source=rosmianto.com&amp;utm_medium=post\" target=\"_blank\" rel=\"noopener noreferrer\">fwguide.rosmianto.com</a></p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Rosmianto A. Saputro"
            },
            "tags": [
                   "Embedded Productivity"
            ],
            "date_published": "2024-02-11T07:25:03+07:00",
            "date_modified": "2024-02-12T09:59:24+07:00"
        },
        {
            "id": "https://rosmianto.com/the-reality-of-learning-embedded.html",
            "url": "https://rosmianto.com/the-reality-of-learning-embedded.html",
            "title": "The Reality of Learning Embedded",
            "summary": "There's a big gap in embedded world. I observed that your experience in embedded is either: Group #1, enjoying their craft with Arduino, but not realizing that there are a whole world beyond Arduino. Group #2, too busy even to guide #1. They are in&hellip;",
            "content_html": "<p>There's a big gap in embedded world.</p>\n<p>I observed that your experience in embedded is either:</p>\n<ol>\n<li>Beginner. Familiar with Arduino. Nothing more.</li>\n<li>Veteran. You are battle-tested, lots of technical scars embedded (nice pun!) in your face.</li>\n</ol>\n<p>Group #1, enjoying their craft with Arduino, but not realizing that there are a whole world beyond Arduino.</p>\n<p>Group #2, too busy even to guide #1. They are in high demand, and they seemed to be always working on something.</p>\n<p>If I draw those two groups, maybe it looked like this:</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://rosmianto.com/media/posts/3/Untitled.png\" alt=\"\" width=\"3494\" height=\"1000\" sizes=\"100vw\" srcset=\"https://rosmianto.com/media/posts/3/responsive/Untitled-xs.png 300w ,https://rosmianto.com/media/posts/3/responsive/Untitled-sm.png 480w ,https://rosmianto.com/media/posts/3/responsive/Untitled-md.png 768w ,https://rosmianto.com/media/posts/3/responsive/Untitled-lg.png 1024w ,https://rosmianto.com/media/posts/3/responsive/Untitled-xl.png 1360w ,https://rosmianto.com/media/posts/3/responsive/Untitled-2xl.png 1600w\"></figure>\n<p>They live in a different island. They have different activity and rules.</p>\n<p>Me myself, just stranded to the veteran island, so I know how it feels to live in both islands.</p>\n<p>The problem is, I got there by swimming, forcing myself to move the hard way. But something I know for sure is swimming isn't for everybody.</p>\n<p>Being a noob is both easy and difficult:</p>\n<ul>\n<li>Easy because you have lots of tutorials for beginner</li>\n<li>Difficult because you have lots of tutorials for beginner</li>\n</ul>\n<p>You see the irony? Tutorials have been a blessing and a curse.</p>\n<h2>The Issue With Tutorials</h2>\n<p>I'm pretty sure you have followed a tutorial at some point in your embedded career. What you usually find?</p>\n<p>Prepare the breadboard 👉 follow the wiring connection 👉 copy the example code 👉 build and flash. Voila!</p>\n<p>Yes, there's some explanations (like Adafruit and Sparkfun tutorials, they're great!), but the nature of tutorial is to <em>guide you do something really specific </em>(like blinking LEDs or reading sensor), nothing more.</p>\n<p>Problem arise when you want to level up your game. You might search for more advanced tutorials, like \"how to use FreeRTOS\", and fortunately you can get that tutorial.</p>\n<p>You then search for even more advanced topic like \"how to set correct FreeRTOS priority values\", no tutorials.</p>\n<p>You search \"how to make performant multiple FreeRTOS tasks\", you ended up with multiple sources, a bit here, a bit there. There's no single tutorials that explains all.</p>\n<p>Yes, that's the reality when you leave that noob island.</p>\n<p>You need to understand multiple concepts at once to understand FreeRTOS priority values.</p>\n<p>You need to understand multiple concepts at once to make performant FreeRTOS tasks.</p>\n<p>It's like Googling \"how to build website like Facebook\" and gets frustrated.</p>\n<p>Building Facebook isn't a tutorial bruh.</p>\n<h2>Noob Island Inhabitants</h2>\n<p>They don't have tutorials for advanced topics so they do what they can. They make sub-par work, even though they use many advanced concepts. I've seen it with my own eye!</p>\n<p>For example, I've seen a junior engineer wanted to run multiple tasks in parallel using ESP32. Instead of using the good ol' FreeRTOS tasks, he used some random library on the internet, acting as a scheduler, and throw code into the scheduler.</p>\n<p>Well, to be fair, the code is working btw.</p>\n<p>BUT IT STUTTERS, LIKE A LOT!</p>\n<p>He wasn't aware that ESP32 has multiple core, and he wasn't even aware the framework provides xTaskCreate() to make tasks.</p>\n<h2>I Want to Help</h2>\n<p>There are definitely issues there, and instead of swimming by themselves to veteran island. I want to build a small ship to help noob island inhabitants cross the sea, and land safely at the veteran island.</p>\n<p>I know, it's just a small dream, but I believe noob island inhabitants also deserve a better experience, better network, better friends, that they can find in veteran island. I believe I have to build a transportation mode, a ship if you want to call it, to help people cross the sea.</p>\n<h2>My Small Ship</h2>\n<p>Here's my little ship (looks like a boat, for now):</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://rosmianto.com/media/posts/3/ship.png\" alt=\"\" width=\"501\" height=\"220\" sizes=\"100vw\" srcset=\"https://rosmianto.com/media/posts/3/responsive/ship-xs.png 300w ,https://rosmianto.com/media/posts/3/responsive/ship-sm.png 480w ,https://rosmianto.com/media/posts/3/responsive/ship-md.png 768w ,https://rosmianto.com/media/posts/3/responsive/ship-lg.png 1024w ,https://rosmianto.com/media/posts/3/responsive/ship-xl.png 1360w ,https://rosmianto.com/media/posts/3/responsive/ship-2xl.png 1600w\"></figure>\n<p>Yeah okay, it's a boat, but eventually I want to grow this little boat into a little ship, then a little yacht, and (hopefully) into a cruise ship. Here's what I will do with the ship:</p>\n<p>For Noob Island to Veteran Island, I will help you cross the sea with my ship. Probably you will look like this:</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://rosmianto.com/media/posts/3/noob-vet.png\" alt=\"\" width=\"2852\" height=\"1000\" sizes=\"100vw\" srcset=\"https://rosmianto.com/media/posts/3/responsive/noob-vet-xs.png 300w ,https://rosmianto.com/media/posts/3/responsive/noob-vet-sm.png 480w ,https://rosmianto.com/media/posts/3/responsive/noob-vet-md.png 768w ,https://rosmianto.com/media/posts/3/responsive/noob-vet-lg.png 1024w ,https://rosmianto.com/media/posts/3/responsive/noob-vet-xl.png 1360w ,https://rosmianto.com/media/posts/3/responsive/noob-vet-2xl.png 1600w\"></figure>\n<p>And for Veteran Island to Noob Island, I will bring resources from Veteran Island, such as their Best Practices, their tools, their network, etc.</p>\n<p>Basically I am a ship captain crossing sea back and forth.</p>\n<p>For now, my little ship is a digital product you can buy right now. It's called Professional Firmware Development Guide, where I show you the workflow I used to build professional-grade firmware for my company and clients.</p>\n<p>If you are interested, you can check it out here: <a href=\"https://fwguide.rosmianto.com\" target=\"_blank\" rel=\"noopener noreferrer\">fwguide.rosmianto.com</a></p>\n<p>Your ship captain is signing out. See you later! ⛵</p>",
            "author": {
                "name": "Rosmianto A. Saputro"
            },
            "tags": [
            ],
            "date_published": "2024-02-10T07:11:31+07:00",
            "date_modified": "2024-02-10T10:35:25+07:00"
        },
        {
            "id": "https://rosmianto.com/the-friday-firmware-newsletter.html",
            "url": "https://rosmianto.com/the-friday-firmware-newsletter.html",
            "title": "The Friday Firmware Newsletter",
            "summary": "Every Friday, I share embedded tips and tricks, embedded career advice, and embedded perspectives. Join other 2200+ fellow engineers today by entering your email address below. Subscribe to get my latest content by email. Subscribe We won't send you spam. Unsubscribe at any time. Built&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://rosmianto.com/media/posts/2/Untitled.png\" alt=\"\" width=\"3494\" height=\"1000\" sizes=\"100vw\" srcset=\"https://rosmianto.com/media/posts/2/responsive/Untitled-xs.png 300w ,https://rosmianto.com/media/posts/2/responsive/Untitled-sm.png 480w ,https://rosmianto.com/media/posts/2/responsive/Untitled-md.png 768w ,https://rosmianto.com/media/posts/2/responsive/Untitled-lg.png 1024w ,https://rosmianto.com/media/posts/2/responsive/Untitled-xl.png 1360w ,https://rosmianto.com/media/posts/2/responsive/Untitled-2xl.png 1600w\"></figure>\n<p>Every Friday, I share embedded tips and tricks, embedded career advice, and embedded perspectives. Join other 2200+ fellow engineers today by entering your email address below.</p>\n<p>\n<script src=\"https://f.convertkit.com/ckjs/ck.5.js\"></script>\n</p>\n<form class=\"seva-form formkit-form\" style=\"background-color: #f9fafb; border-radius: 4px;\" action=\"https://app.convertkit.com/forms/6182417/subscriptions\" method=\"post\" data-sv-form=\"6182417\" data-uid=\"2d99eac9a7\" data-format=\"inline\" data-version=\"5\" data-options=\"{&quot;settings&quot;:{&quot;after_subscribe&quot;:{&quot;action&quot;:&quot;message&quot;,&quot;success_message&quot;:&quot;Success! Now check your email to confirm your subscription.&quot;,&quot;redirect_url&quot;:&quot;&quot;},&quot;analytics&quot;:{&quot;google&quot;:null,&quot;fathom&quot;:null,&quot;facebook&quot;:null,&quot;segment&quot;:null,&quot;pinterest&quot;:null,&quot;sparkloop&quot;:null,&quot;googletagmanager&quot;:null},&quot;modal&quot;:{&quot;trigger&quot;:&quot;timer&quot;,&quot;scroll_percentage&quot;:null,&quot;timer&quot;:5,&quot;devices&quot;:&quot;all&quot;,&quot;show_once_every&quot;:15},&quot;powered_by&quot;:{&quot;show&quot;:true,&quot;url&quot;:&quot;https://convertkit.com/features/forms?utm_campaign=poweredby&amp;utm_content=form&amp;utm_medium=referral&amp;utm_source=dynamic&quot;},&quot;recaptcha&quot;:{&quot;enabled&quot;:false},&quot;return_visitor&quot;:{&quot;action&quot;:&quot;show&quot;,&quot;custom_content&quot;:&quot;&quot;},&quot;slide_in&quot;:{&quot;display_in&quot;:&quot;bottom_right&quot;,&quot;trigger&quot;:&quot;timer&quot;,&quot;scroll_percentage&quot;:null,&quot;timer&quot;:5,&quot;devices&quot;:&quot;all&quot;,&quot;show_once_every&quot;:15},&quot;sticky_bar&quot;:{&quot;display_in&quot;:&quot;top&quot;,&quot;trigger&quot;:&quot;timer&quot;,&quot;scroll_percentage&quot;:null,&quot;timer&quot;:5,&quot;devices&quot;:&quot;all&quot;,&quot;show_once_every&quot;:15}},&quot;version&quot;:&quot;5&quot;}\">\n<div class=\"formkit-background\" style=\"opacity: 0.2;\"> </div>\n<div data-style=\"minimal\">\n<div class=\"formkit-header\" style=\"color: #4d4d4d; font-size: 27px; font-weight: bold;\" data-element=\"header\">\n<h2>Get Embedded Tips Every Friday</h2>\n</div>\n<div class=\"formkit-subheader\" style=\"color: #686868; font-size: 18px;\" data-element=\"subheader\">\n<p>Subscribe to get my latest content by email.</p>\n</div>\n<div class=\"seva-fields formkit-fields\" data-element=\"fields\" data-stacked=\"false\">\n<div class=\"formkit-field\"><input class=\"formkit-input\" style=\"color: #000000; border-color: #e3e3e3; border-radius: 4px; font-weight: 400;\" name=\"email_address\" required=\"\" type=\"email\" placeholder=\"Email Address\" aria-label=\"Email Address\"></div>\n<div class=\"formkit-spinner\">\n<div> </div>\n<div> </div>\n<div> </div>\n</div>\n<button class=\"formkit-submit formkit-submit\" style=\"color: #ffffff; background-color: #1677be; border-radius: 4px; font-weight: 400;\" data-element=\"submit\"><span class=\"\">Subscribe</span> </button></div>\n<div class=\"formkit-guarantee\" style=\"color: #4d4d4d; font-size: 13px; font-weight: 400;\" data-element=\"guarantee\">We won't send you spam. Unsubscribe at any time.</div>\n<div class=\"formkit-powered-by-convertkit-container\"><a href=\"https://convertkit.com/features/forms?utm_campaign=poweredby&amp;utm_content=form&amp;utm_medium=referral&amp;utm_source=dynamic\" data-element=\"powered-by\" class=\"formkit-powered-by-convertkit\" data-variant=\"dark\" target=\"_blank\" rel=\"nofollow noopener\">Built with ConvertKit</a></div>\n</div>\n</form>",
            "author": {
                "name": "Rosmianto A. Saputro"
            },
            "tags": [
                   "Newsletter"
            ],
            "date_published": "2024-02-09T14:44:04+07:00",
            "date_modified": "2024-02-10T10:34:14+07:00"
        }
    ]
}
